 export const caesarCipherInfo = {
    title: 'Caesar Cipher',
    description: 'Шифр Цезаря - это метод шифрования, в котором каждая буква в тексте заменяется на букву, находящуюся на некотором постоянном числе позиций левее или правее в алфавите.',
    usage: [
        'Выберите сдвиг, на который будут сдвигаться буквы. Это может быть любое число от 1 до 25.',
        'Введите текст, который нужно зашифровать или расшифровать.',
        'Нажмите кнопку "Encrypt" (зашифровать) или "Decrypt" (расшифровать), чтобы получить результат.'
    ]
};

 export const affineCipherInfo = {
     title: 'Affine Cipher',
     description: 'Аффинный шифр - это шифр подстановки, в котором каждая буква текста заменяется на другую букву с помощью математической функции.',
     usage: [
         'Выберите коэффициенты a и b, которые будут использоваться для шифрования.',
         'Введите текст, который нужно зашифровать.',
         'Нажмите кнопку "Encrypt", чтобы получить зашифрованный текст.'
     ]
 };

 export const atbashCipherInfo = {
     title: 'Atbash Cipher',
     description: 'Атбаш - это метод шифрования, в котором каждая буква текста заменяется на букву, стоящую в алфавите на том же расстоянии, но с противоположным порядком.',
     usage: [
         'Введите текст, который нужно зашифровать.',
         'Нажмите кнопку "Encrypt", чтобы получить зашифрованный текст.'
     ]
 };

 export const baconCipherInfo = {
     title: 'Bacon Cipher',
     description: 'Шифр Бэкона - это метод шифрования, в котором каждая буква текста заменяется на строку символов, состоящую из символов "A" и "B".',
     usage: [
         'Введите текст, который нужно зашифровать.',
         'Нажмите кнопку "Encrypt", чтобы получить зашифрованный текст.'
     ]
 };

 export const morseCipherInfo = {
     title: 'Morse Cipher',
     description: 'Шифр Морзе - это метод шифрования, в котором каждая буква текста заменяется на последовательность точек и тире.',
     usage: [
         'Введите текст, который нужно зашифровать.',
         'Нажмите кнопку "Encrypt", чтобы получить зашифрованный текст.'
     ]
 };

 export const vigenereCipherInfo = {
     title: 'Vigenere Cipher',
     description: 'Шифр Виженера - это метод шифрования, в котором каждая буква текста шифруется с использованием ключевого слова.',
     usage: [
         'Введите ключевое слово, которое будет использоваться для шифрования.',
         'Введите текст, который нужно зашифровать.',
         'Нажмите кнопку "Encrypt", чтобы получить зашифрованный текст.'
     ]
 };
